# backend/scripts/__init__.py
# -*- coding: utf-8 -*-
"""
Модуль скриптів для автоматизації завдань та управління додатком.

Цей пакет містить різноманітні командні скрипти, які допомагають
у розробці, розгортанні, тестуванні та обслуговуванні додатка.
Скрипти можуть включати завдання, такі як створення суперкористувача,
запуск міграцій бази даних, виконання тестів, генерація документації API тощо.

Для використання конкретного скрипта, зазвичай, його запускають з командного рядка,
перебуваючи в кореневій директорії проекту або в директорії `backend`.
Наприклад: `python -m backend.scripts.create_superuser`
"""
