# backend/app/src/api/v1/__init__.py
# -*- coding: utf-8 -*-
"""
Ініціалізаційний файл для пакету API версії 1 (v1).

Цей файл робить каталог `v1` пакетом Python.
Він також може агрегувати основні компоненти або роутери, специфічні для v1,
але зазвичай основна агрегація роутерів v1 відбувається в `backend.app.src.api.v1.router`.
"""

# Імпорт головного роутера для версії v1, щоб його можна було легко імпортувати ззовні.
from backend.app.src.api.v1.router import router as v1_router

__all__ = (
    "v1_router",
)
