# backend/app/src/api/__init__.py
# -*- coding: utf-8 -*-
"""
Ініціалізаційний файл для пакету API.

Цей файл робить каталог `api` пакетом Python, що дозволяє імпортувати з нього модулі.
Він може також агрегувати основні роутери або компоненти API для зручного доступу.
"""

# TODO: Можливо, тут потрібно буде імпортувати та агрегувати головний роутер API,
# коли він буде створений (наприклад, з backend.app.src.api.router).
# from backend.app.src.api.router import api_router

# __all__ = (
#     "api_router",
# )
