# backend/app/__init__.py
# -*- coding: utf-8 -*-
"""
Ініціалізаційний файл для пакету 'app'.

Цей файл робить каталог 'app' пакетом Python, що дозволяє імпортувати модулі,
які знаходяться всередині цього каталогу.
Він може бути порожнім або містити код ініціалізації для пакета 'app'.
"""
# TODO: Додати будь-який необхідний код ініціалізації для пакета 'app', якщо потрібно.
# Наприклад, можна визначити змінні на рівні пакета або виконати початкове налаштування.
# На даний момент, цей файл залишається переважно порожнім,
# виконуючи свою основну функцію - позначення каталогу як пакета.
